# ExternalServiceOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServiceOptions Class
Members See Also
---
Various options affecting the behavior of an External Service
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ExternalServiceOptions : IDisposable
```

Visual Basic
---
```text
Public Class ExternalServiceOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExternalServiceOptions : IDisposable
```

# Remarks
Options are provided at the time of registering a service. After a service is registered, the options cannot be changed.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.ExternalService..::..ExternalServiceOptions
# See Also
ExternalServiceOptions Members
Autodesk.Revit.DB.ExternalService Namespace